#+Title: Exercise 3.70
It would be nice to be able to generate streams in which the pairs appear in some useful order, rather than in the order that results from an ad hoc interleaving process. We can use a technique similar to the merge procedure of Exercise 3.56, if we define a way to say that one pair of integers is “less than” another. One way to do this is to define a “weighting function” W(i,j) and stipulate that (i1,j1) is less than (i2,j2) if W(i1,j1)<W(i2,j2). Write a procedure merge-weighted that is like merge, except that merge-weighted takes an additional argument weight, which is a procedure that computes the weight of a pair, and is used to determine the order in which elements should appear in the resulting merged stream.197 Using this, generalize pairs to a procedure weighted-pairs that takes two streams, together with a procedure that computes a weighting function, and generates the stream of pairs, ordered according to weight. 
#+BEGIN_SRC scheme :session 3-70 :exports none
  (add-to-load-path (dirname "./"))

  (use-modules (custom-module stream))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC scheme :session 3-70
  (define (merge-weighted s1 s2 weight)
    (cond ((stream-null? s1) s2)
          ((stream-null? s2) s1)
          (else
           (let ((s1car (stream-car s1))
                 (s2car (stream-car s2)))
             (cond ((< (weight s1car) (weight s2car))
                    (cons-stream s1car
                                 (merge-weighted (stream-cdr s1) s2 weight)))
                   ((> (weight s1car) (weight s2car))
                    (cons-stream s2car
                                 (merge-weighted s1 (stream-cdr s2) weight)))
                   (else
                    (cons-stream s1car
                                 (merge-weighted (stream-cdr s1)
                                        (stream-cdr s2) weight))))))))

#+END_SRC

#+RESULTS:

**** Use your procedure to generate

1. the stream of all pairs of positive integers (i,j) with i≤j ordered according to the sum i+j,

unsorted pair
#+BEGIN_SRC scheme :session 3-70 :exports both
  (append '((i j weight))
          (map (lambda (x)
                 (let ((pair (stream-ref (pairs integers integers) x)))
                   (append pair (list (apply + pair)))))
               '(0 1 2 3 4 5 6 7 8 9 10 11 12 13 14)))

#+END_SRC

#+RESULTS:
| i | j | weight |
| 1 | 1 |      2 |
| 1 | 2 |      3 |
| 2 | 2 |      4 |
| 1 | 3 |      4 |
| 2 | 3 |      5 |
| 1 | 4 |      5 |
| 3 | 3 |      6 |
| 1 | 5 |      6 |
| 2 | 4 |      6 |
| 1 | 6 |      7 |
| 3 | 4 |      7 |
| 1 | 7 |      8 |
| 2 | 5 |      7 |
| 1 | 8 |      9 |
| 4 | 4 |      8 |

sorted pair
#+BEGIN_SRC scheme :session 3-70 :exports both
  (define (weight pair)
    (apply + pair))

  (define (pairs-ordered s t)
    (cons-stream
     (list (stream-car s) (stream-car t))
     (merge-weighted
      (stream-map (lambda (x)
                    (list (stream-car s) x))
                  (stream-cdr t))
      (pairs-ordered (stream-cdr s) (stream-cdr t))
      weight)))

  (append '((i j weight))
        (map (lambda (x)
               (let ((pair (stream-ref (pairs-ordered integers integers) x)))
                 (append pair (list (weight pair)))))
             '(0 1 2 3 4 5 6 7 8 9 10 11 12 13 14)))

#+END_SRC

#+RESULTS:
| i |  j | weight |
| 1 |  1 |      2 |
| 1 |  2 |      3 |
| 1 |  3 |      4 |
| 1 |  4 |      5 |
| 1 |  5 |      6 |
| 1 |  6 |      7 |
| 1 |  7 |      8 |
| 1 |  8 |      9 |
| 1 |  9 |     10 |
| 1 | 10 |     11 |
| 1 | 11 |     12 |
| 1 | 12 |     13 |
| 1 | 13 |     14 |
| 1 | 14 |     15 |
| 1 | 15 |     16 |


**** 2. the stream of all pairs of positive integers (i,j) with i≤j, where neither i nor j is divisible by 2, 3, or 5, and the pairs are ordered according to the sum 2i+3j+5ij.
#+BEGIN_SRC scheme :session 3-70
  (define (weight pair)
    (let ((i (car pair))
          (j (cadr pair)))
      (+ (* 2 i)
         (* 3 j)
         (* 5 i j))))

  (define (divisible-by n pair)
    (let ((i (car pair))
          (j (cadr pair)))
      (not (or (= 0 (remainder i n))
               (= 0 (remainder j n))))))

  (define part2
    (stream-filter
    (lambda (x) (divisible-by 5 x))
    (stream-filter
     (lambda (x)
       (divisible-by 3 x))
     (stream-filter
      (lambda (x)
        (divisible-by 2 x))
      (pairs-ordered integers integers)))))

  (map (lambda (x)
         (stream-ref part2 x))
       '(0 1 2 3 4 5 6 7 8 9 10 11 12 13 14))
#+END_SRC

#+RESULTS:
| 1 |  1 |
| 1 |  7 |
| 1 | 11 |
| 1 | 13 |
| 1 | 17 |
| 1 | 19 |
| 1 | 23 |
| 1 | 29 |
| 1 | 31 |
| 7 |  7 |
| 1 | 37 |
| 1 | 41 |
| 1 | 43 |
| 1 | 47 |
| 1 | 49 |

The pair-ordered procedure could have been improved so that it takes an additional weight argument. This would have made it more modular.
